data/fio/RHEL6.7/512k/O_SYNC_RandWrite.log
thread-1: (g=0): rw=randwrite, bs=512K-512K/512K-512K/512K-512K, ioengine=sync, iodepth=1
thread-2: (g=1): rw=randwrite, bs=512K-512K/512K-512K/512K-512K, ioengine=sync, iodepth=1
...
thread-4: (g=2): rw=randwrite, bs=512K-512K/512K-512K/512K-512K, ioengine=sync, iodepth=1
...
thread-8: (g=3): rw=randwrite, bs=512K-512K/512K-512K/512K-512K, ioengine=sync, iodepth=1
...
fio-2.2.9
Starting 15 processes

thread-1: (groupid=0, jobs=1): err= 0: pid=7429: Tue Oct 27 23:14:18 2015
  write: io=4096.0MB, bw=286947KB/s, iops=560, runt= 14617msec
    clat (usec): min=570, max=87635, avg=1758.87, stdev=2292.29
     lat (usec): min=592, max=87655, avg=1780.96, stdev=2292.57
    clat percentiles (usec):
     |  1.00th=[  580],  5.00th=[  588], 10.00th=[  588], 20.00th=[  596],
     | 30.00th=[  604], 40.00th=[  612], 50.00th=[  628], 60.00th=[ 2192],
     | 70.00th=[ 2512], 80.00th=[ 2544], 90.00th=[ 3408], 95.00th=[ 4768],
     | 99.00th=[ 7136], 99.50th=[ 8768], 99.90th=[15808], 99.95th=[21888],
     | 99.99th=[87552]
    bw (KB  /s): min=85844, max=820224, per=100.00%, avg=288093.48, stdev=249037.21
    lat (usec) : 750=54.13%, 1000=0.11%
    lat (msec) : 2=0.04%, 4=38.31%, 10=7.09%, 20=0.27%, 50=0.02%
    lat (msec) : 100=0.04%
  cpu          : usr=1.61%, sys=25.22%, ctx=8205, majf=0, minf=40
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=8192/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-2: (groupid=1, jobs=1): err= 0: pid=7430: Tue Oct 27 23:14:18 2015
  write: io=2048.0MB, bw=83131KB/s, iops=162, runt= 25227msec
    clat (usec): min=573, max=161255, avg=6131.31, stdev=4418.55
     lat (usec): min=595, max=161276, avg=6154.45, stdev=4418.58
    clat percentiles (usec):
     |  1.00th=[  628],  5.00th=[ 4768], 10.00th=[ 4768], 20.00th=[ 4768],
     | 30.00th=[ 4832], 40.00th=[ 5408], 50.00th=[ 5728], 60.00th=[ 6048],
     | 70.00th=[ 6432], 80.00th=[ 6944], 90.00th=[ 8032], 95.00th=[ 8896],
     | 99.00th=[15680], 99.50th=[18304], 99.90th=[91648], 99.95th=[92672],
     | 99.99th=[160768]
    bw (KB  /s): min=64383, max=183873, per=50.71%, avg=83202.50, stdev=15961.88
    lat (usec) : 750=3.39%, 1000=0.05%
    lat (msec) : 4=0.02%, 10=93.58%, 20=2.69%, 50=0.10%, 100=0.15%
    lat (msec) : 250=0.02%
  cpu          : usr=0.48%, sys=7.54%, ctx=4131, majf=0, minf=38
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=4096/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-2: (groupid=1, jobs=1): err= 0: pid=7431: Tue Oct 27 23:14:18 2015
  write: io=2048.0MB, bw=82042KB/s, iops=160, runt= 25562msec
    clat (usec): min=567, max=260625, avg=6213.31, stdev=5333.80
     lat (usec): min=589, max=260646, avg=6236.31, stdev=5333.79
    clat percentiles (usec):
     |  1.00th=[  668],  5.00th=[ 4768], 10.00th=[ 4768], 20.00th=[ 4768],
     | 30.00th=[ 4832], 40.00th=[ 5472], 50.00th=[ 5728], 60.00th=[ 6112],
     | 70.00th=[ 6496], 80.00th=[ 6944], 90.00th=[ 8032], 95.00th=[ 8896],
     | 99.00th=[15424], 99.50th=[18560], 99.90th=[89600], 99.95th=[90624],
     | 99.99th=[261120]
    bw (KB  /s): min=64383, max=109349, per=49.81%, avg=81723.04, stdev=7743.45
    lat (usec) : 750=1.61%, 1000=0.07%
    lat (msec) : 2=0.02%, 4=0.78%, 10=94.58%, 20=2.49%, 50=0.29%
    lat (msec) : 100=0.12%, 500=0.02%
  cpu          : usr=0.50%, sys=7.41%, ctx=4257, majf=0, minf=40
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=4096/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-4: (groupid=2, jobs=1): err= 0: pid=7433: Tue Oct 27 23:14:18 2015
  write: io=1024.0MB, bw=42142KB/s, iops=82, runt= 24882msec
    clat (usec): min=653, max=109202, avg=12120.29, stdev=5715.82
     lat (usec): min=675, max=109224, avg=12144.08, stdev=5715.36
    clat percentiles (usec):
     |  1.00th=[  812],  5.00th=[ 9664], 10.00th=[ 9792], 20.00th=[ 9920],
     | 30.00th=[10176], 40.00th=[10688], 50.00th=[11328], 60.00th=[11968],
     | 70.00th=[12480], 80.00th=[13376], 90.00th=[14912], 95.00th=[16768],
     | 99.00th=[24192], 99.50th=[28288], 99.90th=[98816], 99.95th=[101888],
     | 99.99th=[109056]
    bw (KB  /s): min=31030, max=76494, per=25.05%, avg=42227.27, stdev=6162.92
    lat (usec) : 750=0.63%, 1000=0.83%
    lat (msec) : 2=0.10%, 4=0.05%, 10=21.68%, 20=74.07%, 50=2.29%
    lat (msec) : 100=0.24%, 250=0.10%
  cpu          : usr=0.22%, sys=3.92%, ctx=2225, majf=0, minf=40
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=2048/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-4: (groupid=2, jobs=1): err= 0: pid=7434: Tue Oct 27 23:14:18 2015
  write: io=1024.0MB, bw=42198KB/s, iops=82, runt= 24849msec
    clat (usec): min=650, max=103664, avg=12104.10, stdev=5761.87
     lat (usec): min=672, max=103688, avg=12127.64, stdev=5761.72
    clat percentiles (usec):
     |  1.00th=[  756],  5.00th=[ 9664], 10.00th=[ 9792], 20.00th=[ 9792],
     | 30.00th=[10176], 40.00th=[10688], 50.00th=[11328], 60.00th=[11840],
     | 70.00th=[12352], 80.00th=[13248], 90.00th=[15040], 95.00th=[16768],
     | 99.00th=[25472], 99.50th=[28288], 99.90th=[98816], 99.95th=[99840],
     | 99.99th=[103936]
    bw (KB  /s): min=31882, max=82449, per=25.05%, avg=42227.21, stdev=6909.54
    lat (usec) : 750=0.83%, 1000=0.93%
    lat (msec) : 2=0.20%, 10=21.97%, 20=73.29%, 50=2.44%, 100=0.29%
    lat (msec) : 250=0.05%
  cpu          : usr=0.31%, sys=3.83%, ctx=2201, majf=0, minf=38
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=2048/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-4: (groupid=2, jobs=1): err= 0: pid=7435: Tue Oct 27 23:14:18 2015
  write: io=1024.0MB, bw=42203KB/s, iops=82, runt= 24846msec
    clat (usec): min=596, max=109101, avg=12103.04, stdev=5819.41
     lat (usec): min=618, max=109124, avg=12126.63, stdev=5819.41
    clat percentiles (usec):
     |  1.00th=[  748],  5.00th=[ 9664], 10.00th=[ 9792], 20.00th=[ 9920],
     | 30.00th=[10176], 40.00th=[10816], 50.00th=[11328], 60.00th=[11840],
     | 70.00th=[12480], 80.00th=[13376], 90.00th=[15040], 95.00th=[16768],
     | 99.00th=[23936], 99.50th=[27520], 99.90th=[98816], 99.95th=[102912],
     | 99.99th=[109056]
    bw (KB  /s): min=31030, max=82778, per=25.06%, avg=42244.75, stdev=6946.52
    lat (usec) : 750=1.03%, 1000=0.73%
    lat (msec) : 2=0.20%, 10=21.39%, 20=73.97%, 50=2.34%, 100=0.24%
    lat (msec) : 250=0.10%
  cpu          : usr=0.29%, sys=3.83%, ctx=2335, majf=0, minf=41
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=2048/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-4: (groupid=2, jobs=1): err= 0: pid=7436: Tue Oct 27 23:14:18 2015
  write: io=1024.0MB, bw=42210KB/s, iops=82, runt= 24842msec
    clat (usec): min=596, max=108719, avg=12100.68, stdev=5752.42
     lat (usec): min=618, max=108742, avg=12124.48, stdev=5752.37
    clat percentiles (usec):
     |  1.00th=[  748],  5.00th=[ 9664], 10.00th=[ 9792], 20.00th=[ 9920],
     | 30.00th=[10176], 40.00th=[10816], 50.00th=[11328], 60.00th=[11968],
     | 70.00th=[12480], 80.00th=[13376], 90.00th=[15040], 95.00th=[17024],
     | 99.00th=[24704], 99.50th=[26496], 99.90th=[98816], 99.95th=[103936],
     | 99.99th=[109056]
    bw (KB  /s): min=30832, max=82944, per=25.07%, avg=42252.85, stdev=6978.81
    lat (usec) : 750=0.98%, 1000=0.73%
    lat (msec) : 2=0.20%, 10=21.39%, 20=74.02%, 50=2.34%, 100=0.24%
    lat (msec) : 250=0.10%
  cpu          : usr=0.28%, sys=3.86%, ctx=2255, majf=0, minf=37
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=2048/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-8: (groupid=3, jobs=1): err= 0: pid=7445: Tue Oct 27 23:14:18 2015
  write: io=524288KB, bw=21505KB/s, iops=42, runt= 24380msec
    clat (usec): min=814, max=549673, avg=23778.46, stdev=25971.91
     lat (usec): min=841, max=549694, avg=23802.88, stdev=25971.30
    clat percentiles (usec):
     |  1.00th=[ 1160],  5.00th=[ 9920], 10.00th=[15168], 20.00th=[17536],
     | 30.00th=[20096], 40.00th=[21632], 50.00th=[22656], 60.00th=[23424],
     | 70.00th=[24704], 80.00th=[25984], 90.00th=[28544], 95.00th=[32128],
     | 99.00th=[67072], 99.50th=[112128], 99.90th=[522240], 99.95th=[552960],
     | 99.99th=[552960]
    bw (KB  /s): min= 1872, max=61195, per=12.56%, avg=21525.39, stdev=7422.91
    lat (usec) : 1000=0.29%
    lat (msec) : 2=3.71%, 4=0.29%, 10=1.56%, 20=21.19%, 50=71.78%
    lat (msec) : 100=0.39%, 250=0.49%, 500=0.10%, 750=0.20%
  cpu          : usr=0.13%, sys=1.97%, ctx=1416, majf=0, minf=39
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=1024/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-8: (groupid=3, jobs=1): err= 0: pid=7446: Tue Oct 27 23:14:18 2015
  write: io=524288KB, bw=21423KB/s, iops=41, runt= 24473msec
    clat (usec): min=582, max=559036, avg=23869.67, stdev=28859.59
     lat (usec): min=604, max=559060, avg=23893.67, stdev=28859.38
    clat percentiles (usec):
     |  1.00th=[ 1032],  5.00th=[ 4896], 10.00th=[14912], 20.00th=[17536],
     | 30.00th=[20096], 40.00th=[21376], 50.00th=[22656], 60.00th=[23680],
     | 70.00th=[24704], 80.00th=[26240], 90.00th=[28544], 95.00th=[32384],
     | 99.00th=[63232], 99.50th=[114176], 99.90th=[522240], 99.95th=[561152],
     | 99.99th=[561152]
    bw (KB  /s): min= 4932, max=60831, per=12.35%, avg=21164.98, stdev=7360.04
    lat (usec) : 750=0.68%, 1000=0.10%
    lat (msec) : 2=3.22%, 4=0.10%, 10=3.22%, 20=21.29%, 50=70.31%
    lat (msec) : 100=0.20%, 250=0.49%, 500=0.20%, 750=0.20%
  cpu          : usr=0.14%, sys=1.94%, ctx=1329, majf=0, minf=37
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=1024/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-8: (groupid=3, jobs=1): err= 0: pid=7447: Tue Oct 27 23:14:18 2015
  write: io=524288KB, bw=22408KB/s, iops=43, runt= 23397msec
    clat (usec): min=605, max=551065, avg=22818.58, stdev=26772.76
     lat (usec): min=628, max=551088, avg=22842.99, stdev=26772.08
    clat percentiles (usec):
     |  1.00th=[  628],  5.00th=[  708], 10.00th=[ 1928], 20.00th=[17536],
     | 30.00th=[20096], 40.00th=[21376], 50.00th=[22656], 60.00th=[23680],
     | 70.00th=[24704], 80.00th=[25984], 90.00th=[28288], 95.00th=[32128],
     | 99.00th=[42240], 99.50th=[112128], 99.90th=[544768], 99.95th=[552960],
     | 99.99th=[552960]
    bw (KB  /s): min=  929, max=61440, per=13.13%, avg=22509.55, stdev=7727.72
    lat (usec) : 750=5.76%, 1000=0.78%
    lat (msec) : 2=3.71%, 4=0.20%, 10=0.10%, 20=17.97%, 50=70.51%
    lat (msec) : 100=0.29%, 250=0.39%, 500=0.10%, 750=0.20%
  cpu          : usr=0.13%, sys=2.06%, ctx=1392, majf=0, minf=39
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=1024/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-8: (groupid=3, jobs=1): err= 0: pid=7448: Tue Oct 27 23:14:18 2015
  write: io=524288KB, bw=21679KB/s, iops=42, runt= 24184msec
    clat (usec): min=652, max=552085, avg=23585.48, stdev=25857.25
     lat (usec): min=674, max=552108, avg=23610.62, stdev=25856.16
    clat percentiles (usec):
     |  1.00th=[  668],  5.00th=[ 1528], 10.00th=[15296], 20.00th=[17536],
     | 30.00th=[20096], 40.00th=[21376], 50.00th=[22656], 60.00th=[23424],
     | 70.00th=[24704], 80.00th=[25984], 90.00th=[28544], 95.00th=[32384],
     | 99.00th=[63232], 99.50th=[108032], 99.90th=[518144], 99.95th=[552960],
     | 99.99th=[552960]
    bw (KB  /s): min=10534, max=55890, per=12.91%, avg=22120.96, stdev=6466.34
    lat (usec) : 750=2.05%, 1000=0.20%
    lat (msec) : 2=3.42%, 4=0.39%, 10=0.39%, 20=20.80%, 50=71.58%
    lat (msec) : 100=0.39%, 250=0.49%, 500=0.10%, 750=0.20%
  cpu          : usr=0.17%, sys=1.99%, ctx=1435, majf=0, minf=39
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=1024/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-8: (groupid=3, jobs=1): err= 0: pid=7449: Tue Oct 27 23:14:18 2015
  write: io=524288KB, bw=21456KB/s, iops=41, runt= 24435msec
    clat (usec): min=645, max=556580, avg=23832.63, stdev=27932.01
     lat (usec): min=671, max=556605, avg=23857.21, stdev=27931.56
    clat percentiles (usec):
     |  1.00th=[ 1064],  5.00th=[ 4960], 10.00th=[15168], 20.00th=[17536],
     | 30.00th=[20096], 40.00th=[21632], 50.00th=[22656], 60.00th=[23680],
     | 70.00th=[24704], 80.00th=[25984], 90.00th=[28544], 95.00th=[32384],
     | 99.00th=[58624], 99.50th=[112128], 99.90th=[514048], 99.95th=[552960],
     | 99.99th=[552960]
    bw (KB  /s): min=10816, max=55107, per=12.53%, avg=21467.09, stdev=6192.85
    lat (usec) : 750=0.10%, 1000=0.78%
    lat (msec) : 2=3.22%, 4=0.29%, 10=2.64%, 20=20.61%, 50=71.29%
    lat (msec) : 100=0.20%, 250=0.49%, 500=0.20%, 750=0.20%
  cpu          : usr=0.13%, sys=1.97%, ctx=1527, majf=0, minf=37
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=1024/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-8: (groupid=3, jobs=1): err= 0: pid=7450: Tue Oct 27 23:14:18 2015
  write: io=524288KB, bw=21507KB/s, iops=42, runt= 24377msec
    clat (usec): min=813, max=554173, avg=23775.34, stdev=26005.78
     lat (usec): min=931, max=554197, avg=23799.90, stdev=26005.13
    clat percentiles (usec):
     |  1.00th=[ 1128],  5.00th=[ 9920], 10.00th=[15680], 20.00th=[17536],
     | 30.00th=[20096], 40.00th=[21376], 50.00th=[22656], 60.00th=[23680],
     | 70.00th=[24704], 80.00th=[25984], 90.00th=[28288], 95.00th=[31872],
     | 99.00th=[72192], 99.50th=[112128], 99.90th=[528384], 99.95th=[552960],
     | 99.99th=[552960]
    bw (KB  /s): min=  966, max=55673, per=12.54%, avg=21493.26, stdev=6976.21
    lat (usec) : 1000=0.29%
    lat (msec) : 2=4.00%, 4=0.10%, 10=1.56%, 20=21.29%, 50=71.58%
    lat (msec) : 100=0.39%, 250=0.49%, 500=0.10%, 750=0.20%
  cpu          : usr=0.15%, sys=1.96%, ctx=1522, majf=0, minf=40
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=1024/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-8: (groupid=3, jobs=1): err= 0: pid=7451: Tue Oct 27 23:14:18 2015
  write: io=524288KB, bw=25578KB/s, iops=49, runt= 20498msec
    clat (usec): min=643, max=547668, avg=19987.12, stdev=22020.96
     lat (usec): min=668, max=547699, avg=20011.01, stdev=22021.03
    clat percentiles (usec):
     |  1.00th=[  652],  5.00th=[  660], 10.00th=[  668], 20.00th=[  700],
     | 30.00th=[19840], 40.00th=[21120], 50.00th=[22144], 60.00th=[23168],
     | 70.00th=[24448], 80.00th=[25728], 90.00th=[28032], 95.00th=[31616],
     | 99.00th=[40704], 99.50th=[104960], 99.90th=[272384], 99.95th=[544768],
     | 99.99th=[544768]
    bw (KB  /s): min= 1777, max=45805, per=15.12%, avg=25910.15, stdev=6499.07
    lat (usec) : 750=20.80%
    lat (msec) : 2=1.07%, 4=0.20%, 10=0.68%, 20=8.59%, 50=67.87%
    lat (msec) : 100=0.20%, 250=0.39%, 500=0.10%, 750=0.10%
  cpu          : usr=0.18%, sys=2.36%, ctx=1054, majf=0, minf=37
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=1024/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-8: (groupid=3, jobs=1): err= 0: pid=7452: Tue Oct 27 23:14:18 2015
  write: io=524288KB, bw=21706KB/s, iops=42, runt= 24154msec
    clat (usec): min=650, max=561178, avg=23557.26, stdev=26867.30
     lat (usec): min=674, max=561202, avg=23581.45, stdev=26866.78
    clat percentiles (usec):
     |  1.00th=[  668],  5.00th=[ 1320], 10.00th=[15168], 20.00th=[17536],
     | 30.00th=[20096], 40.00th=[21376], 50.00th=[22656], 60.00th=[23680],
     | 70.00th=[24704], 80.00th=[25984], 90.00th=[28288], 95.00th=[32384],
     | 99.00th=[74240], 99.50th=[112128], 99.90th=[544768], 99.95th=[561152],
     | 99.99th=[561152]
    bw (KB  /s): min=10240, max=60472, per=12.96%, avg=22209.87, stdev=7039.41
    lat (usec) : 750=2.05%, 1000=0.49%
    lat (msec) : 2=3.91%, 4=0.29%, 10=0.10%, 20=21.00%, 50=71.00%
    lat (msec) : 100=0.39%, 250=0.49%, 500=0.10%, 750=0.20%
  cpu          : usr=0.10%, sys=2.06%, ctx=1443, majf=0, minf=39
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=1024/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: io=4096.0MB, aggrb=286946KB/s, minb=286946KB/s, maxb=286946KB/s, mint=14617msec, maxt=14617msec

Run status group 1 (all jobs):
  WRITE: io=4096.0MB, aggrb=164083KB/s, minb=82041KB/s, maxb=83131KB/s, mint=25227msec, maxt=25562msec

Run status group 2 (all jobs):
  WRITE: io=4096.0MB, aggrb=168567KB/s, minb=42141KB/s, maxb=42209KB/s, mint=24842msec, maxt=24882msec

Run status group 3 (all jobs):
  WRITE: io=4096.0MB, aggrb=171384KB/s, minb=21423KB/s, maxb=25577KB/s, mint=20498msec, maxt=24473msec

Disk stats (read/write):
  sdb: ios=15/35808, merge=0/4152538, ticks=1595/392368, in_queue=393958, util=95.51%